from tranport import doClosedView

# Пример задачи где надо дав=бавить мнимого потребителя
A = [2000, 2500] # Запасы
B = [1000, 1300, 1200] # Потребности
C = [ # Цена перевозок
    [4, 6, 3],
    [5, 5, 2]
    ]

doClosedView(A, B, C)

# Пример задачи где надо дав=бавить мнимого поставщика
A = [2000, 1500] # Запасы
B = [1000, 1300, 2200] # Потребности
C = [ # Цена перевозок
    [4, 6, 3],
    [5, 5, 2]
    ]

doClosedView(A, B, C)

# Пример закрытой задачи
A = [2000, 1500] # Запасы
B = [1000, 1300, 1200] # Потребности
C = [ # Цена перевозок
    [4, 6, 3],
    [5, 5, 2]
    ]

doClosedView(A, B, C)

# Пример нашей задачи
A = [33, 35, 17, 12] # Запасы
B = [23, 34, 5, 16, 19] # Потребности
C = [ # Цена перевозок
    [1, 4, 7, 8, 11],
    [3, 5, 9, 7, 14],
    [4, 5, 12, 6, 9],
    [6, 10,11,17,13]
    ]

doClosedView(A, B, C)